pec1=load('pec1.dat');  %відгружаємо файл
fs=1000;    %частота
fcg=pec1(:,1);   %зчитуємо дані з першого стовпчика
ecg=pec1(:,2);   %зчитуємо дані з другого стовпчика
cps=pec1(:,3);   %зчитуємо дані з третього стовпчика
t=(0:length(fcg)-1)/fs; %визначаємо час
figure(1)   %відкриваємо фігуру
subplot(3,1,1), plot(t,fcg),xlim([1 4]),ylabel('ФКГ') %xlim(від до) - ліміт по х
title ('Біосигнали')    %заголовок першого графіка
subplot(3,1,2), plot(t,ecg),xlim([1 4]),ylabel('ЕКГ')
subplot(3,1,3), plot(t,cps),xlim([1 4]),ylabel('СКП')
xlabel('Час,с')
length(pec1)    %визначаємо кількість елементів файлу